Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v9.0.ino
  // Czas z zatrzymanego/testowego/12h RTC nie jest aktualny -> odrzucamy odczyt.
  constexpr uint8_t CTRL1_INVALID_MODE_MASK = CTRL1_EXT_TEST | CTRL1_STOP | CTRL1_12H;
  // prepareTimeWrite zeruje takze CIE (INT wylacznie dla alarmu wybudzajacego).
  constexpr uint8_t CTRL1_RUN_CLEAR_MASK    = CTRL1_EXT_TEST | CTRL1_STOP | CTRL1_CIE | CTRL1_12H;

  constexpr uint8_t FORMAT_MARKER    = 0xA5;     // w REG_RAM_BYTE: "czas zapisal ten firmware"
}

// --- Kalibracja dryftu krysztalu RTC (rejestr Offset 0x02 PCF85063A) -----------
//   offset DODATNI spowalnia zegar; UJEMNY przyspiesza. Offset[LSB]=blad_ppm/4.34.
//   Zmierzony surowy dryft -2 s/24h -> -5 LSB = -21.7 ppm. 0x7B = -5 LSB, MODE=0.
//   FACTORY_OFFSET_REG to wartosc STARTOWA; z ENABLE_RTC_AUTOTRIM biezacy offset
//   zyje w NVS ("rtcOffLsb") i jest korygowany automatycznie z pomiarow NTP.
namespace rtccfg {
  constexpr uint8_t  FACTORY_OFFSET_REG   = 0x7B;    // -5 LSB, MODE=0 (-21.7 ppm; przyspiesza)
  constexpr float    OFFSET_LSB_PPM_MODE0 = 4.34f;
  constexpr float    OFFSET_LSB_PPM_MODE1 = 4.069f;
  constexpr uint8_t  OFFSET_WRITE_RETRIES = 4;
  constexpr float    PPM_SEC_PER_DAY      = 0.0864f; // 1 ppm = 0.0864 s/dobe

  constexpr uint32_t WRITE_RETRY_MS       = 5000;    // ponowienie zapisu czasu po NTP
  constexpr uint8_t  WRITE_RETRIES        = 12;
  constexpr int      WRITE_VERIFY_TOLERANCE_SEC = 2; // odczyt zwrotny po zapisie czasu
  constexpr int64_t  ALIGN_ABORT_US       = 1500000; // wyrownanie fazy startuje z <=1 s;
                                                     // wiecej = rownolegly skok czasu -> przerwij zapis
  constexpr int      WAKE_MAX_SKEW_SEC    = 30;      // rozjazd RTC/system dyskwalifikuje alarm

#if ENABLE_RTC_AUTOTRIM
  // Pomiar fazowy (granica sekundy RTC vs czas NTP) ma rozdzielczosc ~ms, wiec juz
  // jedno okno 6 h daje ppm z niepewnoscia ~0.1 ppm — wystarcza do korekty o 1 LSB
  // (4.34 ppm). Kwantyzacja rejestru ogranicza dryf resztkowy do ~±2.2 ppm,
  // czyli ~±0.19 s/dobe — ponizej celu 1 s/dobe.
  constexpr int64_t  AUTOTRIM_MIN_WINDOW_SEC     = 6 * 3600;   // min. okno NTP->NTP
  constexpr int64_t  AUTOTRIM_MAX_WINDOW_SEC     = 7 * 86400;  // dluzsze = watpliwa kotwica
  constexpr float    AUTOTRIM_MAX_PLAUSIBLE_PPM  = 150.0f;     // wiecej = zly pomiar, nie kalibruj
  constexpr uint32_t BOUNDARY_POLL_TIMEOUT_MS    = 1300;       // >1 s: przewrot MUSI nadejsc
#endif
}

// --- Kodek audio ES8311 --------------------------------------------------------
namespace es8311 {
  constexpr uint8_t I2C_ADDR       = 0x18;
  constexpr uint8_t REG_RESET      = 0x00;  // reset / power-up sekwencja
  constexpr uint8_t REG_CLK_MGR1   = 0x01;
  constexpr uint8_t REG_SDP_IN     = 0x09;  // format danych I2S (DAC)
  constexpr uint8_t REG_SDP_OUT    = 0x0A;  // format danych I2S (ADC)
  constexpr uint8_t REG_DAC_VOLUME = 0x32;
  constexpr uint8_t DAC_VOLUME_MAX = 215;   // 0xD7 ~ +12 dB; mniejsze ryzyko przesteru niz 0xFF
}

// --- Akumulator (Samsung INR18650-35E) ------------------------------------------
#ifndef BATTERY_CAPACITY_MAH
#define BATTERY_CAPACITY_MAH 3400          // nadpisywalne z linii kompilacji (-D)
#endif
namespace batcfg {
  constexpr uint32_t     CAPACITY_MAH        = BATTERY_CAPACITY_MAH;
  constexpr adc_channel_t ADC_CHANNEL        = ADC_CHANNEL_3;   // = GPIO4 na ESP32-S3
  constexpr float        DIVIDER_RATIO       = 3.0f;
  constexpr float        VOLTAGE_CALIBRATION = 1.017f;
  constexpr uint8_t      SAMPLE_COUNT        = 16;
  constexpr float        EMA_KEEP            = 0.80f; // filtr napiecia: 80% starej + 20% nowej probki
  constexpr int          ADC_FALLBACK_FULL_MV = 3300; // przelicznik bez kalibracji eFuse
  constexpr int          ADC_MAX_RAW          = 4095;
  constexpr uint8_t      FULL_FLOOR          = 99;   // >=99% pokazuj 100%
  constexpr uint8_t      FULL_HOLD_FLOOR     = 98;   // trzymaj 100% az spadnie < 98%
  constexpr uint32_t     READ_INTERVAL_MS    = 10UL * 60UL * 1000UL;
  constexpr uint32_t     BUSY_RETRY_MS       = 30UL * 1000UL;

  // Ochrona niskiego stanu ogniwa (dwustopniowa).
  constexpr uint8_t      LOW_PERCENT          = 15;     // stopien 1: bez auto-NTP
  constexpr float        CRITICAL_VOLTAGE     = 3.05f;  // stopien 2: ochronny deep-sleep
  constexpr uint8_t      CRITICAL_PERCENT     = 3;
  constexpr uint32_t     CRITICAL_RECHECK_SEC = 30UL * 60UL;

  // Estymator zuzycia (czysta arytmetyka na probkach SoC).
  constexpr uint8_t      DRAIN_CHARGE_HYST     = 5;      // wzrost SoC% = "doladowano" -> reset kotwicy
  constexpr int64_t      DRAIN_MIN_WINDOW_SEC  = 43200;  // min. 12 h danych (plaskie plateau = szum ADC)
  constexpr int          DRAIN_MIN_DSOC        = 2;      // min. spadek SoC%, by estymata miala sens

  // Krzywa OCV->SoC dla INR18650-35E (Li-ion NMC), 3.00 V=0%, 4.20 V=100%.
  struct OcvPoint { float voltage; uint8_t soc; };
  constexpr std::array<OcvPoint, 24> OCV_CURVE = {{
    { 3.00f,   0 }, { 3.10f,   2 }, { 3.20f,   4 }, { 3.30f,   7 },
    { 3.40f,  11 }, { 3.45f,  14 }, { 3.50f,  18 }, { 3.55f,  23 },
    { 3.60f,  29 }, { 3.65f,  36 }, { 3.70f,  43 }, { 3.73f,  47 },
    { 3.76f,  51 }, { 3.79f,  55 }, { 3.82f,  59 }, { 3.85f,  63 },
    { 3.88f,  68 }, { 3.91f,  71 }, { 3.95f,  76 }, { 4.00f,  80 },
    { 4.05f,  87 }, { 4.10f,  93 }, { 4.15f,  97 }, { 4.20f, 100 },
  }};
}

// --- Budziki i audio ------------------------------------------------------------
namespace alarmcfg {
  constexpr int      ALARM_COUNT          = 3;
  constexpr int      SOUND_COUNT          = 3;
  constexpr int      MAX_VOLUME           = 21;    // natywny zakres audioI2S setVolume
  constexpr uint8_t  DEFAULT_VOLUME       = 10;
  constexpr uint8_t  CODEC_VOLUME_PERCENT = 100;
  constexpr uint32_t LATE_WINDOW_SEC      = 20;    // ile po terminie budzik jeszcze "wchodzi"
  constexpr uint32_t RING_RETRY_MS        = 3000;
  constexpr uint32_t RING_MIN_PLAY_MS     = 750;   // krocej = uszkodzony MP3 (patrz serviceAudio)
  constexpr uint8_t  RING_MAX_ERRORS      = 10;
  constexpr uint32_t RING_TIMEOUT_MS      = 15UL * 60UL * 1000UL;
  constexpr uint32_t LOOP_GAP_MARGIN_SEC  = 2;     // zapas okna spoznienia ponad przestoj petli

