Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v9.0.ino
bool RtcController::readControl1(uint8_t *control1) {
  if (!control1 || !beginSession()) return false;
  return readRegs(pcf85063::REG_CONTROL1, control1, 1);
}
bool RtcController::readControl2(uint8_t *control2) {
  if (!control2 || !beginSession()) return false;
  return readRegs(pcf85063::REG_CONTROL2, control2, 1);
}
bool RtcController::writeControl1(uint8_t control1) {
  return writeReg(pcf85063::REG_CONTROL1, control1);
}

bool RtcController::releaseClock(uint8_t runningControl1) {
  for (uint8_t attempt = 0; attempt < 3; attempt++) {
    if (writeControl1(runningControl1)) return true;
    delay(2);
  }
  return false;
}

// Zatrzymaj licznik przed ustawieniem czasu. STOP zeruje glowna czesc preskalera
// -> pierwszy impuls sekundowy ma okreslona faze.
bool RtcController::prepareTimeWrite(uint8_t *runningControl1) {
  if (!runningControl1) return false;
  uint8_t control1;
  if (!readControl1(&control1)) return false;
  *runningControl1 = control1 & (uint8_t)~pcf85063::CTRL1_RUN_CLEAR_MASK;
  if (writeControl1(*runningControl1 | pcf85063::CTRL1_STOP)) return true;
  releaseClock(*runningControl1);
  return false;
}

// Marker w bajcie RAM RTC: "czas zapisal ten firmware w znanym formacie".
// Brak markera = RTC ustawiony przez cos innego / niepelny zapis -> nie ufamy.
bool RtcController::hasCurrentFormat() {
  uint8_t marker;
  return readRegs(pcf85063::REG_RAM_BYTE, &marker, 1) && marker == pcf85063::FORMAT_MARKER;
}
bool RtcController::storeCurrentFormat()      { return writeReg(pcf85063::REG_RAM_BYTE, pcf85063::FORMAT_MARKER); }
bool RtcController::invalidateCurrentFormat() { return writeReg(pcf85063::REG_RAM_BYTE, 0); }

// Odczyt 7 rejestrow czasu (0x04..0x0A) jednym transferem -> brak rwania na granicy
// sekundy. Rok 00..99 = 2000..2099.
bool RtcController::readEpochInternal(time_t *epoch, bool requireCurrentFormat) {
  if (!epoch) return false;
  uint8_t control1;
  if (!readControl1(&control1)) return false;

  // Nie wznawiaj po cichu zatrzymanego/przestawionego RTC (staly czas != aktualny).
  if ((control1 & pcf85063::CTRL1_INVALID_MODE_MASK) != 0 ||
      (requireCurrentFormat && !hasCurrentFormat())) return false;

  uint8_t t[7];
  if (!readRegs(pcf85063::REG_SECONDS, t, 7)) return false;
  uint8_t secReg = t[0], minReg = t[1], hourReg = t[2], dayReg = t[3];
  uint8_t monReg = t[5], yearReg = t[6];   // t[4] = dzien tygodnia (pomijamy)

  bool oscStopped = (secReg & pcf85063::SECONDS_OS) != 0;
  secReg &= 0x7F; minReg &= 0x7F; hourReg &= 0x3F; dayReg &= 0x3F; monReg &= 0x1F;

  if (oscStopped || !validBcd(secReg) || !validBcd(minReg) || !validBcd(hourReg) ||
      !validBcd(dayReg) || !validBcd(monReg) || !validBcd(yearReg)) return false;

  int s  = bcd2dec(secReg), mi = bcd2dec(minReg), h = bcd2dec(hourReg);
  int d  = bcd2dec(dayReg), mo = bcd2dec(monReg), y = bcd2dec(yearReg) + 2000;

  if (!validDateTime(y, mo, d, h, mi, s)) return false;
  *epoch = utcEpochFromCivil(y, mo, d, h, mi, s);
  return true;
}

bool RtcController::readEpoch(time_t *epoch) { return readEpochInternal(epoch, true); }

bool RtcController::readToSystem() {
  for (uint8_t attempt = 0; attempt < 3; attempt++) {
    time_t epoch;
    if (readEpoch(&epoch)) { setSystemEpochMidSecond(epoch); return true; }
    delay(2);
  }
  return false;
}

// Zapis czasu UTC do RTC z WYROWNANIEM do granicy sekundy. Po zwolnieniu STOP
// preskaler startuje od zera, wiec wpisana sekunda "trzyma sie" ~1.0 s -> faza
// przewrotu = chwila zwolnienia STOP. Pomijamy wyrownanie gdy gra audio/budzik
// (audioActive) — busy-wait do ~1 s przerwalby audio.loop().
bool RtcController::writeTime(time_t epoch, bool audioActive) {
  if (!isSupportedEpoch(epoch)) return false;
#if ENABLE_RTC_AUTOTRIM
  g_persist.rtcPhaseAligned = false;   // az do potwierdzonego, wyrownanego zapisu
#endif

  struct timeval tv;
  gettimeofday(&tv, nullptr);
  time_t writeEpoch = epoch;
  bool   alignToBoundary = false;
  if (!audioActive &&
      isSupportedEpoch(tv.tv_sec) && (tv.tv_sec == epoch || tv.tv_sec + 1 == epoch)) {
    writeEpoch = tv.tv_sec + 1;          // najblizsza nadchodzaca pelna sekunda
    alignToBoundary = true;
  }

  struct tm gm;
  gmtime_r(&writeEpoch, &gm);
  int year = gm.tm_year + 1900;

  // Najpierw uniewaznij dane: reset w dowolnym dalszym miejscu nie ujawni
  // niepelnego zapisu jako poprawnego czasu.
  if (!beginSession()) return false;
  if (!invalidateCurrentFormat()) return false;
  uint8_t runningControl1;
  if (!prepareTimeWrite(&runningControl1)) return false;
  uint8_t yearReg = (uint8_t)(year % 100);

  wire_.beginTransmission(pcf85063::I2C_ADDR);
  wire_.write(pcf85063::REG_SECONDS);
  wire_.write(dec2bcd(gm.tm_sec) & 0x7F);            // OS=0 -> oscylator OK
  wire_.write(dec2bcd(gm.tm_min) & 0x7F);
  wire_.write(dec2bcd(gm.tm_hour) & 0x3F);
  wire_.write(dec2bcd(gm.tm_mday) & 0x3F);
  wire_.write((uint8_t)(gm.tm_wday & 0x07));
  wire_.write(dec2bcd((uint8_t)(gm.tm_mon + 1)) & 0x1F);
  wire_.write(dec2bcd(yearReg));
  if (wire_.endTransmission() != 0) { releaseClock(runningControl1); return false; }

  // Odczekaj do granicy docelowej sekundy (czas I2C wliczony), potem zwolnij STOP.
  if (alignToBoundary) {
    struct timeval nowTv;
    for (;;) {
      gettimeofday(&nowTv, nullptr);
      int64_t remainingUs = ((int64_t)writeEpoch - nowTv.tv_sec) * 1000000LL - nowTv.tv_usec;
      if (remainingUs <= 0) break;
      // Startowalismy z <=1 s zapasu; wiecej oznacza, ze rownolegly settimeofday
      // (np. pakiet SNTP w tasku lwIP) skoczyl czasem — kotwica stracila sens.
      // Przerwij CALY zapis: marker formatu juz uniewazniony, retry ponowi zapis
      // swiezym czasem (fix v8.0: wczesniej petla mogla wisiec do resetu TWDT).
      if (remainingUs > rtccfg::ALIGN_ABORT_US) { releaseClock(runningControl1); return false; }
      watchdogFeed();
      if (remainingUs > 2000) delay(1); else delayMicroseconds((uint32_t)remainingUs);
    }
  }
  if (!releaseClock(runningControl1)) return false;

  time_t verifiedEpoch;
  if (!readEpochInternal(&verifiedEpoch, false)) return false;
  long long diff = (long long)verifiedEpoch - (long long)writeEpoch;
  if (diff < -rtccfg::WRITE_VERIFY_TOLERANCE_SEC || diff > rtccfg::WRITE_VERIFY_TOLERANCE_SEC) return false;
  if (storeCurrentFormat() && hasCurrentFormat()) {
#if ENABLE_RTC_AUTOTRIM
    g_persist.rtcPhaseAligned = alignToBoundary;   // okno dryftu mierzalne fazowo
#endif
    return true;
  }
  invalidateCurrentFormat();
  return false;
}

// Kalibracja sprzetowa dryfu (rejestr 0x02) Z WERYFIKACJA odczytem zwrotnym.
// Wolana przy KAZDYM starcie: rejestr jest podtrzymywany bateryjnie, ale ponowny
// zapis+odczyt dowodzi, ze bajt wszedl. Cel zapisu = targetOffsetReg_ (start:
// FACTORY_OFFSET_REG; SettingsStore::load moze nadpisac wartoscia z NVS).
bool RtcController::ensureOffsetCalibration() {
  offsetVerified_ = false;
  for (uint8_t attempt = 0; attempt < rtccfg::OFFSET_WRITE_RETRIES; attempt++) {
    if (!beginSession()) { delay(2); continue; }
    writeReg(pcf85063::REG_OFFSET, targetOffsetReg_);
    uint8_t raw;
    if (readRegs(pcf85063::REG_OFFSET, &raw, 1)) {
      offsetRaw_ = raw;
      offsetLsb_ = decodeRtcOffset(raw);
      offsetPpm_ = rtcOffsetPpm(offsetLsb_, (raw & 0x80) != 0);
      if (raw == targetOffsetReg_) { offsetVerified_ = true; return true; }
    }
    delay(2);
  }
  return false;
}

