Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v9.0.ino
  if (!app_.soundStore().ensureMounted() || !ensureCodec()) return fail("blad FS/kodek", false);
  const char *path = alarmcfg::SOUND_FILES[soundIndex];
  if (!app_.soundStore().fs()->exists(path)) return fail(String("brak ") + path, true);

  digitalWrite(pins::PA_ENABLE, HIGH);
  decoder_.stopSong();
  decoder_.setVolume(constrain(volume, 0, alarmcfg::MAX_VOLUME));
  codec_.setVolume(alarmcfg::CODEC_VOLUME_PERCENT);
  if (!decoder_.connecttoFS(*app_.soundStore().fs(), path))
    return fail(String("blad odtw. ") + path, true);

  soundStartedMs_ = millis();
  playing_ = true;
  Serial.printf("Odtwarzam %s vol=%u\n", path, volume);
  app_.markDirty();
  return true;
}

void AudioPlayer::stopPlayback(StopCause cause) {
  bool userStopped = (cause == StopCause::User);
  if (userStopped) { ringing_ = false; ringingAlarm_ = -1; ringErrors_ = 0; }
  if (ready_) {
    decoder_.stopSong();
    decoder_.setVolume(0);
    codec_.setVolume(0);
    digitalWrite(pins::PA_ENABLE, LOW);
  }
  if (playing_) { app_.setStatus(userStopped ? "STOP" : "koniec"); playing_ = false; app_.markDirty(); }
}

void AudioPlayer::startRinging(int alarmIndex) {
  ringing_ = true;
  ringingAlarm_ = alarmIndex;
  ringStartMs_ = millis();
  ringLastRetryMs_ = millis();
  ringErrors_ = 0;
  const AlarmConfig &alarm = app_.alarms().config(alarmIndex);
  app_.setStatus(String("BUDZI: ") + alarm.label);
  app_.markDirty();
  if (!startSound(alarm.sound, alarm.volume)) {
    ringErrors_ = 1;
    ringLastRetryMs_ = millis() - alarmcfg::RING_RETRY_MS;
  }
}

void AudioPlayer::serviceAudio() {
  if (!playing_) return;
  if (!ready_) {
    playing_ = false;
    digitalWrite(pins::PA_ENABLE, LOW);
    if (!ringing_) app_.setStatus("audio stop");
    app_.markDirty();
    return;
  }
  decoder_.loop();
  if (!decoder_.isRunning()) {
    if (ringing_) {
      // connecttoFS() zwraca true dla KAZDEGO istniejacego pliku; uszkodzony MP3
      // "konczy sie" po kilkudziesieciu ms. Bez zliczania budzik krecil sie cicho.
      playing_ = false;
      if (millis() - soundStartedMs_ < alarmcfg::RING_MIN_PLAY_MS) {
        if (++ringErrors_ >= alarmcfg::RING_MAX_ERRORS) {
          app_.setStatus("budzik: blad MP3"); ringing_ = false; ringingAlarm_ = -1;
        }
      } else ringErrors_ = 0;
      app_.markDirty();
      return;
    }
    stopPlayback(StopCause::Auto);
  }
}

void AudioPlayer::serviceRinging() {
  if (!ringing_) return;
  if (millis() - ringStartMs_ > alarmcfg::RING_TIMEOUT_MS) {
    app_.setStatus("budzik: timeout");
    stopPlayback(StopCause::Auto);
    ringing_ = false; ringingAlarm_ = -1;
    app_.markDirty();
    return;
  }
  if (playing_) return;
  if (millis() - ringLastRetryMs_ < alarmcfg::RING_RETRY_MS) return;
  ringLastRetryMs_ = millis();
  if (ringingAlarm_ >= 0) {
    const AlarmConfig &alarm = app_.alarms().config(ringingAlarm_);
    if (startSound(alarm.sound, alarm.volume)) return;
  }
  if (++ringErrors_ >= alarmcfg::RING_MAX_ERRORS) {
    app_.setStatus("budzik: blad MP3"); ringing_ = false; ringingAlarm_ = -1; app_.markDirty();
  }
}

// ============================================================================
//  IMPLEMENTACJE — AlarmScheduler (model + harmonogram wyzwolen)
// ============================================================================
void AlarmScheduler::setDefaults() {
  for (int i = 0; i < alarmcfg::ALARM_COUNT; i++) {
    alarms_[i].enabled = 0;
    alarms_[i].hour = 7; alarms_[i].minute = 0; alarms_[i].second = 0;
    alarms_[i].volume = alarmcfg::DEFAULT_VOLUME;
    alarms_[i].sound = (uint8_t)i;
    snprintf(alarms_[i].label, sizeof(alarms_[i].label), "Budzik %d", i + 1);
  }
}

void AlarmScheduler::resetTriggerState() {
  for (int i = 0; i < alarmcfg::ALARM_COUNT; i++) g_persist.lastTriggerDay[i] = -1;
}

// Napraw wpis po odczycie z NVS/formularza: kazde pole sprowadzone do zakresu.
void AlarmScheduler::sanitize(int index) {
  AlarmConfig &alarm = alarms_[index];
  alarm.enabled = alarm.enabled ? 1 : 0;
  if (alarm.hour > 23) alarm.hour = 7;
  if (alarm.minute > 59) alarm.minute = 0;
  if (alarm.second > 59) alarm.second = 0;
  if (alarm.volume > alarmcfg::MAX_VOLUME) alarm.volume = alarmcfg::DEFAULT_VOLUME;
  if (alarm.sound >= alarmcfg::SOUND_COUNT) alarm.sound = (uint8_t)(index % alarmcfg::SOUND_COUNT);
  alarm.label[sizeof(alarm.label) - 1] = '\0';
  if (alarm.label[0] == '\0')
    snprintf(alarm.label, sizeof(alarm.label), "Budzik %d", index + 1);
}

void AlarmScheduler::sanitizeAll() {
  for (int i = 0; i < alarmcfg::ALARM_COUNT; i++) sanitize(i);
}

bool AlarmScheduler::anyEnabled() const {
  for (const AlarmConfig &a : alarms_) if (a.enabled) return true;
  return false;
}

// Najblizszy wlaczony budzik (dzis/jutro). Ranking po realnym epoch (mktime).
// Bez waznego czasu zwraca pierwszy wlaczony (delta = indeks).
NextAlarmInfo AlarmScheduler::nextAlarm() const {
  NextAlarmInfo info;
  info.index = -1;
  info.hour = info.minute = info.second = 0;
  info.label[0] = '\0';

  struct tm t;
  bool hasTime = getLocalTm(&t);
  time_t now = hasTime ? time(nullptr) : 0;
  long bestDelta = LONG_MAX;
  for (int i = 0; i < alarmcfg::ALARM_COUNT; i++) {
    const AlarmConfig &a = alarms_[i];
    if (!a.enabled) continue;
    long delta;
    if (hasTime) delta = (long)(nextOccurrence(t, a.hour, a.minute, a.second, now) - now);
    else delta = i;
    if (delta < bestDelta) {
      bestDelta = delta;
      info.index = i;
      info.hour = a.hour; info.minute = a.minute; info.second = a.second;
      strncpy(info.label, a.label, sizeof(info.label) - 1);
      info.label[sizeof(info.label) - 1] = '\0';
    }
  }
  return info;
}

// Budzik wymagalny PODCZAS dzwonienia innego nie moze przepasc (fix v8.0):
// oznacz go jako wyzwolony (dedup) i zapamietaj — zadzwoni zaraz po zakonczeniu
// biezacego dzwonienia. Deep-sleep nie grozi utrata kolejki: dzwonienie trzyma
// App::busy(), wiec zaden sen nie przerywa tego stanu.
void AlarmScheduler::queueWhileRinging(const struct tm &t, time_t now, uint32_t lateWindowSec) {
  if (pendingAlarm_ >= 0) return;
  for (int i = 0; i < alarmcfg::ALARM_COUNT; i++) {
    if (!alarms_[i].enabled) continue;
    int occurrenceDay;
    if (alarmDueNow(t, now, alarms_[i].hour, alarms_[i].minute, alarms_[i].second,
                    lateWindowSec, &occurrenceDay, nullptr) &&
        g_persist.lastTriggerDay[i] != occurrenceDay) {
      g_persist.lastTriggerDay[i] = occurrenceDay;
      pendingAlarm_ = i;
      return;
    }
  }
}

bool AlarmScheduler::firePendingIfAny() {
  if (pendingAlarm_ < 0) return false;
  int index = pendingAlarm_;
  pendingAlarm_ = -1;
  if (!alarms_[index].enabled) return false;   // wylaczony w miedzyczasie przez WWW
  app_.audio().startRinging(index);
  return true;
}

void AlarmScheduler::checkAlarms(uint32_t lateWindowSec) {
  time_t now = time(nullptr);
  struct tm t;
  if (!isSupportedEpoch(now)) return;
  localtime_r(&now, &t);

  if (app_.audioActive()) {              // dzwoni: nie startuj drugiego dzwonienia,
    queueWhileRinging(t, now, lateWindowSec);   // ale nie gub terminow
    return;
  }
  if (firePendingIfAny()) return;

