Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v9.0.ino
void NetworkTimeService::finishNtpAttempt(bool ok) {
  bool wasManual = manualAttempt_;
  state_ = NtpState::Idle;
  manualAttempt_ = false;
  wifiHintActive_ = false;
  wifiLostMs_ = 0;
  stopSntpCallbacks();
  g_ntpGotPacket.store(false, std::memory_order_release);

  if (ok) {
    retriesLeft_ = 0;
    backoffMs_ = ntpcfg::BACKOFF_MIN_MS;              // reset backoffu po sukcesie
  } else if (!wasManual && retriesLeft_ > 0) {
    nextRetryMs_ = millis() + ntpcfg::QUICK_RETRY_MS; // dokoncz serie szybka
  } else if (!isSupportedEpoch(time(nullptr))) {
    // Brak waznego czasu -> ponawiaj z BACKOFFEM (1 min -> 1 h). Dotyczy takze
    // proby RECZNEJ (manual ustawia retriesLeft_=0): zegar bez czasu nie moze
    // zostac bez zaplanowanego ponowienia tylko dlatego, ze klikniecie zawiodlo.
    retriesLeft_ = 1;
    nextRetryMs_ = millis() + backoffMs_;
    backoffMs_ = (backoffMs_ >= ntpcfg::BACKOFF_MAX_MS / 2) ? ntpcfg::BACKOFF_MAX_MS : backoffMs_ * 2;
  }
  if (!app_.web().isActive()) wifiPowerOff();
  app_.markDirty();
}

// Wspolna sciezka porazki w WaitingForPacket: NAJPIERW odetnij SNTP (spozniony
// pakiet nie moze nadpisac przywracanego czasu), potem rollback i zamkniecie proby.
void NetworkTimeService::failNtpAttempt(const char *status) {
  stopSntpCallbacks();
  restoreTimeAfterFailedNtp();
  app_.setNtpStatus(status);
  finishNtpAttempt(false);
}

void NetworkTimeService::beginNtpRequest() {
  g_ntpAcceptPacket.store(false, std::memory_order_release);
  g_ntpGotPacket.store(false, std::memory_order_release);
  sntp_set_time_sync_notification_cb(onSntpSync);   // PRZED configTzTime
  sntp_set_sync_mode(SNTP_SYNC_MODE_IMMED);
  gettimeofday(&fallbackTime_, nullptr);
  g_ntpAcceptPacket.store(true, std::memory_order_release);
  configTzTime(ntpcfg::TZ_POLAND, ntpcfg::SERVER_1, ntpcfg::SERVER_2, ntpcfg::SERVER_3);
  state_ = NtpState::WaitingForPacket;
  wifiLostMs_ = 0;                     // swiezy grace 8 s dla tej proby
  stateStartedMs_ = millis();
  app_.setNtpStatus("oczekiwanie na NTP");
  app_.markDirty();
}

void NetworkTimeService::syncNow(SyncTrigger trigger) {
  if (state_ != NtpState::Idle) return;
  bool manual = (trigger == SyncTrigger::Manual);
  if (manual) retriesLeft_ = 0;
  manualAttempt_ = manual;
  app_.setNtpStatus(manual ? "manual: laczenie WiFi" : "auto: laczenie WiFi");
  app_.markDirty();

  if (strlen(ssid_) == 0) { app_.setNtpStatus("brak SSID WiFi"); finishNtpAttempt(false); return; }

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(true);
  if (WiFi.status() == WL_CONNECTED) {
    beginNtpRequest();
  } else {
    wifiHintActive_ = wifiBeginSmart();
    state_ = NtpState::WifiConnecting;
    stateStartedMs_ = millis();
  }
}

// Wolane co petle. Zwraca true gdy NTP wlasnie zatwierdzil nowy czas (dla okna budzika).
bool NetworkTimeService::service() {
  if (state_ == NtpState::WifiConnecting) {
    if (WiFi.status() == WL_CONNECTED) {
      wifiCacheHint();
      beginNtpRequest();
    } else if (wifiHintActive_ && millis() - stateStartedMs_ >= ntpcfg::WIFI_HINT_FALLBACK_MS) {
      wifiHintActive_ = false;
      app_.setNtpStatus("WiFi: pelny skan");
      wifiRetryFullScan();
      stateStartedMs_ = millis();
      app_.markDirty();
    } else if (millis() - stateStartedMs_ >= ntpcfg::WIFI_TIMEOUT_MS) {
      app_.setNtpStatus("blad WiFi");
      g_persist.wifiHint = false;
      finishNtpAttempt(false);
    }
    return false;
  }

  if (state_ != NtpState::WaitingForPacket) return false;

  if (g_ntpGotPacket.load(std::memory_order_acquire)) {
    stopSntpCallbacks();                       // zablokuj kolejny pakiet w trakcie zatwierdzania
    time_t syncedEpoch = time(nullptr);
    if (!isSupportedEpoch(syncedEpoch)) {
      restoreTimeAfterFailedNtp();
      app_.setNtpStatus("bledny czas NTP");
      finishNtpAttempt(false);
      return false;
    }
#if ENABLE_RTC_AUTOTRIM
    maybeAutotrimRtc(syncedEpoch);             // pomiar fazowy PRZED nadpisaniem RTC
    syncedEpoch = time(nullptr);               // pomiar mogl potrwac ~1.3 s -> swiezy epoch,
                                               // inaczej writeTime nie wyrowna fazy
#endif
    struct tm local = {};
    localtime_r(&syncedEpoch, &local);

#if ENABLE_DIAGNOSTICS
    { // Dryft: porownaj STARY czas RTC (jeszcze nienadpisany) z czasem NTP.
      time_t oldRtc;
      if (app_.rtc().readEpoch(&oldRtc)) g_persist.lastRtcDriftSec = (int32_t)(oldRtc - syncedEpoch);
      g_persist.prevNtpSyncEpoch = g_persist.lastNtpSyncEpoch;
      g_persist.lastNtpSyncEpoch = (int64_t)syncedEpoch;
    }
#else
    g_persist.lastNtpSyncEpoch = (int64_t)syncedEpoch;
#endif

    bool rtcOk = app_.rtc().writeTime(syncedEpoch, app_.audioActive());
    if (rtcOk) rtcWriteRetriesLeft_ = 0; else scheduleRtcWriteRetry();
    char buf[48];
    snprintf(buf, sizeof(buf), "OK %02d:%02d:%02d RTC:%s",
             local.tm_hour, local.tm_min, local.tm_sec, rtcOk ? "OK" : "RETRY");
    app_.setNtpStatus(buf);
    // Znacznik dobowego synchro 18:00 zalicza WYLACZNIE sync w oknie wieczornym
    // (>=18:00, przed noca). Poranne 06:00 ma wlasny znacznik ntpMorningDay —
    // wspoldzielenie znacznika blokowaloby wieczorna synchronizacje (fix z v6.x).
    if (local.tm_hour >= ntpcfg::DAILY_SYNC_HOUR && local.tm_hour < powercfg::NIGHT_START_HOUR)
      g_persist.ntpStartedDay = localDayKey(local);
    // Udany sync w oknie porannym konsumuje ntpMorningDay: sync odpalony z setup
    // (zimny start / pusty RTC o 06:0x) nie zostanie zdublowany przez checkSchedule;
    // nieudany NIE konsumuje — checkSchedule ma prawo sprobowac ponownie.
    if (local.tm_hour == powercfg::NIGHT_END_HOUR && local.tm_min < ntpcfg::SYNC_MINUTE_WINDOW)
      g_persist.ntpMorningDay = localDayKey(local);
    finishNtpAttempt(true);
    return true;
  }

  // Zerwane WiFi w trakcie oczekiwania: pakiet juz nie nadejdzie. Krotki grace
  // (auto-reconnect czesto wraca po chwili), potem szybkie zakonczenie proby
  // zamiast palenia radia do pelnego PACKET_TIMEOUT_MS (50 s).
  if (WiFi.status() != WL_CONNECTED) {
    if (wifiLostMs_ == 0) {
      wifiLostMs_ = millis();
    } else if (millis() - wifiLostMs_ >= ntpcfg::WIFI_LOST_GRACE_MS) {
      failNtpAttempt("blad NTP (WiFi zerwane)");
      return false;
    }
  } else {
    wifiLostMs_ = 0;
  }

  if (millis() - stateStartedMs_ >= ntpcfg::PACKET_TIMEOUT_MS) {
    failNtpAttempt("blad NTP");
  }
  return false;
}

