Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v9.0.ino
  markDirty();
}

void App::loop() {
  watchdogFeed();
  buttons_.pollKey();
  buttons_.pollPreview();
  power_.enterNightSleepIfNeeded(false);

  if (web_.isActive()) web_.service();

  audio_.serviceAudio();
  audio_.serviceRinging();
  // Koniec dzwieku w czasie okna WWW/podgladu: idlePowerSave nie biega (busy),
  // wiec uspienie ES8311 i zdjecie podbicia CPU robimy tu — jedno miejsce dla
  // wszystkich sciezek konca odtwarzania. Przerwy miedzy powtorkami budzika
  // chroni audioActive() (ringing_ trzyma true).
  if (audio_.codecActive() && !audioActive()) audio_.shutdownCodec();
  battery_.update(false);
#if ENABLE_LOW_BATTERY_PROTECT
  power_.enterCriticalBatterySleepIfNeeded();
#endif
  bool ntpAdjustedTime = ntp_.service();
  // Okno spoznienia poszerzone o realny przestoj petli: dlugi handleClient (upload
  // MP3) ani 60 s light-sleep nie moga zgubic budzika z terminem w trakcie przestoju.
  uint32_t loopGapSec = lastAlarmCheckMs_ ? (millis() - lastAlarmCheckMs_) / 1000UL : 0;
  lastAlarmCheckMs_ = millis();
  uint32_t lateWindowSec = ntpAdjustedTime ? ntpcfg::ALARM_CATCHUP_SEC : alarmcfg::LATE_WINDOW_SEC;
  if (loopGapSec + alarmcfg::LOOP_GAP_MARGIN_SEC > lateWindowSec)
    lateWindowSec = loopGapSec + alarmcfg::LOOP_GAP_MARGIN_SEC;
  alarms_.checkAlarms(lateWindowSec);
  ntp_.checkSchedule();
  ntp_.handleRtcWriteRetry();
  display_.update();
  power_.idlePowerSave();
}

// ============================================================================
//  Punkty wejscia Arduino — cala logika w App.
// ============================================================================
void setup() { app.setup(); }
void loop()  { app.loop(); }
